//#define _CRT_SECURE_NO_WARNINGS 1
//#include<stdio.h>
////右移操作符>>:移动补码，有/2的效果。负整数左边加符号位
//int main()
//{
//	int a = 16;//00010000
//	int b = a >> 1;
//	printf("b=%d\n",b);
////左移操作符<<:移动补码，右边补0，有*2的效果
//	int c = 5;
//	int d = c<< 1;
//	printf("d=%d\n",d);//10
//
////按位（按位指的是二进制位）与，或，异或
//	int e = 3;//3的二进制为:00000000000000000000000000000011
//	int f = 5;//5的二进制为:00000000000000000000000000000101
//	//					e&f:00000000000000000000000000000001
//	//按位与：两边有一个为0：结果就为0，两边同为1,结果才为1
//	
//	//与
//	int g = e&f;
//	printf("g=%d\n",g);//1
//
//	//或:一个为1就为1
//	int h = e | f;//000000000000000000000000000000111
//	printf("h=%d\n",h);//7
//
//	//异或^:两个相同都为0，相异为1：
//	int i = e^f;//00000000000000000000000000000110
//	printf("i=%d\n",i);
//
//	return 0;
//}